Австралия/src/Enums/PeripheralTypes/PeripheralTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PeripheralTypes</name>
  <enumValues>
    <name>BarCodeScanner</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>MagneticCardReader</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>FiscalRegister</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>CustomerDisplay</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>DataCollectionTerminal</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>POSTerminal</name>
    <comment>POSTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ElectronicScales</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>LabelsPrintingScales</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>CashRegistersOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/PeripheralDriverHandlers/PeripheralDriverHandlers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PeripheralDriverHandlers</name>
  <enumValues>
    <name>Handler1CBarCodeScanners</name>
    <comment>BarCodeScanner</comment>
  </enumValues>
  <enumValues>
    <name>Handler1CBarCodeScannersNative</name>
    <comment>BarCodeScanner</comment>
  </enumValues>
  <enumValues>
    <name>Handler1CFiscalRegistersEmulator</name>
    <comment>FiscalRegister</comment>
  </enumValues>
  <enumValues>
    <name>Handler1CMagneticCardReaders</name>
    <comment>MagneticCardReader</comment>
  </enumValues>
</mdclass:Enum>

Австралия/src/CommonModules/EquipmentManagerServerCallOverridable/Module.bsl
#Region ProgramInterface

// Returns available equipment types list
//
Function GetAvailableEquipmentTypes() Export
	
	EquipmentList = New Array;

	// Bar code scanners
	EquipmentList.Add(Enums.PeripheralTypes.BarCodeScanner);
	// End Barcode scanners

	// Magnetic card readers
	EquipmentList.Add(Enums.PeripheralTypes.MagneticCardReader);
	// End Mangnet cards reader

	// Fiscal cash registers
	EquipmentList.Add(Enums.PeripheralTypes.FiscalRegister);
	// End Fiscal resgisters

	// Customer displays
	EquipmentList.Add(Enums.PeripheralTypes.CustomerDisplay);
	// End Customners displays

	// Data collection terminals
	EquipmentList.Add(Enums.PeripheralTypes.DataCollectionTerminal);
	// End Data collection terminals

	// POS terminals
	EquipmentList.Add(Enums.PeripheralTypes.POSTerminal);
    // End POS terminals
	
	// Electronic scales
	EquipmentList.Add(Enums.PeripheralTypes.ElectronicScales);
	// End Electronuc scales

	// Labels printing scales
	EquipmentList.Add(Enums.PeripheralTypes.LabelsPrintingScales);
	// End Scales with label printing

	// CR offline
	EquipmentList.Add(Enums.PeripheralTypes.CashRegistersOffline);
	// End CR offline
	
	Return EquipmentList;
	
EndFunction

// Returns availability flag for new drivers to the drivers catalog.
//
Function PossibilityToAddNewDrivers() Export
	
	YouCanAddNewDrivers = True;
	Return YouCanAddNewDrivers;
	
EndFunction

// Returns the flag showing that it is possible to call the separated data from the current session.
// Returns True if there is a call in the undivided configuration.
//
// Returns:
// Boolean.
//
Function CanUseSeparatedData() Export
	
	Return True;
	
EndFunction

// Update supplied drivers within the configuration
//                                   
Procedure RefreshSuppliedDrivers() Export
	
	// Bar code scanners
	Catalogs.HardwareDrivers.FillPredefinedItem(Enums.PeripheralDriverHandlers.Handler1CBarCodeScannersNative, "AddIn.InputDevice", "Driver1CNativeInputDevice", False, "8.1.8.1");
	// End Barcode scanners
	
	// Magnetic card readers

	// End Mangnet cards reader
	
	// Fiscal cash registers
	
	// End Fiscal resgisters
	
	// Customer displays
	
	// End Customners displays
	
	// Data collection terminals
	
	// End Data collection terminals
	
	// POS terminals
	
	// End POS terminals
	
	// Electronic scales
	
	// End Electronuc scales
	
	// Labels printing scales
	
	// End Scales with label printing
	
	// CR offline
	
	// End CR offline
	
EndProcedure

#EndRegion

#Region EquipmentOffline

// The function returns the goods sold by weight used to generate barcode.
// Used for loading to scales with printing labels
Function GetWeightProductPrefix(PeripheralsRef) Export
	
	Prefix = Undefined;
	Return Prefix;
	
EndFunction

// The function returns the prefix of piece goods used to generate barcode
// Used for loading to scales with printing labels
Function GetPieceProductPrefix(PeripheralsRef) Export
	
	Prefix = Undefined;
	Return Prefix;
	
EndFunction

#EndRegion

#Region WorkWithFormInstanceEquipment

// Additional redefined actions with controlled form
// in the Equipment instance for the OnCreateAtServer event
//
Procedure EquipmentInstanceOnCreateAtServer(Object, ThisForm, Cancel, Parameters, StandardProcessing) Export

EndProcedure

// Additional redefined actions with controlled form
// in the Equipment instance for "OnReadAtServer"
//
Procedure EquipmentInstanceOnReadAtServer(CurrentObject, ThisForm) Export

EndProcedure

// Additional  redefined actions with controlled form
// in the Equipment form for the BeforeRecordingOnServer event
//
Procedure EquipmentInstanceBeforeWriteAtServer(Cancel, CurrentObject, WriteParameters) Export

EndProcedure

// Additional  redefined actions with controlled form  in
// the Equipment instance for the OnWriteAtServer event
//
Procedure EquipmentInstanceOnWriteAtServer(Cancel, CurrentObject, WriteParameters) Export

EndProcedure

// Additional  redefined actions with controlled form
// in the Equipment instance for the AfterRecordedOnServer event
//
Procedure EquipmentInstanceAfterWriteAtServer(CurrentObject, WriteParameters) Export

EndProcedure

// Additional  redefined actions with controlled form
// in the Equipment instance for the ProcessingOnServerFillinCheck event
//
Procedure EquipmentInstanceFillCheckProcessingAtServer(Object, ThisForm, Cancel, CheckedAttributes) Export

EndProcedure

#EndRegion

#Region SupportCompatibility

// The function creates a node for this instance of peripherals and returns a link to it.
// Used before recording the element of the Peripherals catalog
Function GetDIBNode(PeripheralsObject) Export
	
	NodeObject = ExchangePlans.ExchangeWithOfflinePeripherals.CreateNode();
	NodeObject.SetNewCode();
	NodeObject.Description = PeripheralsObject.Description;
	NodeObject.Write();
	
	Return NodeObject.Ref;
	
EndFunction

#EndRegion
